app/views/users/index.html.erb

					<li>
						<small><%= pluralize(user.articles.count, "article") if user.articles %> </small>
---
SELECT COUNT(*) FROM `articles` WHERE `articles`.`user_id` = 2