app/controllers/articles_controller.rb

	def index
		@articles = Article.all.paginate(page: params[:page], per_page: 5)
---
SELECT  `articles`.* FROM `articles` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `articles`

	def create
		#render plain: params[:article].inspects
		@article = Article.new(article_params)
		@article.user = User.first
		if @article.save
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('test article for user', 'Description of the article\r\n', '2017-07-03 05:58:59', '2017-07-03 05:58:59', 2)

	def update
		if @article.update(article_params)
---
UPDATE `articles` SET `title` = 'asbkjjb edit', `description` = 'edit  nvklvnfivnivh', `updated_at` = '2017-05-31 12:34:26' WHERE `articles`.`id` = 16

    def update_status
    	article = Article.find(params[:id])
    	if params[:checked] == "true"
    	  article.status = true
    	else
    	  article.status = false
    	end
    	article.save(validate: false)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 9 LIMIT 1
UPDATE `articles` SET `status` = 1, `updated_at` = '2017-07-25 09:21:09' WHERE `articles`.`id` = 9