app/controllers/users_controller.rb

	def index
		@users= User.all.paginate(page: params[:page], per_page: 5)
---
SELECT  `users`.* FROM `users` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `users`

	def create
		@user= User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password`) VALUES ('vbdvjn', 'bbcjbdvb@lnivn.com', '2017-07-14 04:59:12', '2017-07-14 04:59:12', '789456123')

	def update
		@user= User.find(params[:id])
		@user.attributes = user_params
		if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `username` = 'efGarimaef', `updated_at` = '2017-07-21 06:12:41' WHERE `users`.`id` = 3